import sys
REPEAT_FOUR = 4
REPEAT_SIX = 6
REPEAT_EIGHT = 8
REPEAT_TEN = 10
REPEAT_TWEALVE = 12
HYPE_EX = 'hyper_ex'
ST_THRUST = 'standing_thrust'
TRAC_CHEST = 'traction_chest'
TRAC_HOR = 'traction_horiz'
SIT_DWN = 'sit_down'
LEG_PSH = 'leg_push'
LEG_EXT = 'leg_extension'
LEG_BEND = 'leg_bending'
CALF_WIR = 'calf'
NECK_BND = 'neck_bend'
THR_BLOCK = 'thrust_block'
HEAD_EXT = 'head_extension'
BIC_PULL = 'bicep_pull'
THR_BIC = 'bicep_trhust'
BIC_PUMP = 'bicep_pump'
BNC_PRES = 'benc_pres'
BNC_DUMB = 'bench_dumbbells'
DUMB_LAY = 'dumbbell_laying'
DUMB_PRES = 'dumbell_pres'
DELT_SMTH = 'deltas_smith'
DMB_WIR = 'wiring_dumbbels'
WIR_PRS = 'pres'
def get_exercise(exercise_name):
    print('Входящий параметр функци в функции exercise == {}'.format(exercise_name))
    exercises = {
        HYPE_EX: 'Гиперекстензия',
        ST_THRUST: 'Становая тяга',
        TRAC_CHEST: 'Тяга блока к груди',
        TRAC_HOR: 'Тяга блока горизонтально',
        SIT_DWN: 'Присяд',
        LEG_PSH: 'Жим ногами',
        LEG_EXT: 'Разгибание ног',
        LEG_BEND: 'Сгибание ног',
        CALF_WIR: 'Икры',
        NECK_BND: 'Розгиб грифа Z',
        THR_BLOCK: 'Тяга блока в кроссовере',
        HEAD_EXT: 'Разгибание гантели из-за головы',
        BIC_PULL: 'Тяга штанги на бицепс',
        THR_BIC: 'Тяга на бицепс сидя грифом Z',
        BIC_PUMP: 'Пампинг бицепса',
        BNC_PRES: 'Жим лежа',
        BNC_DUMB: 'Жим гантелями лежа',
        DUMB_LAY: 'Разводки гантелями лежа',
        DUMB_PRES: 'Жим гантелей сидя',
        DELT_SMTH: 'Жим на дельты в Смите',
        DMB_WIR: 'Розводки гантелей стоя',
        WIR_PRS: 'В конце тренировки - пресс'
    }
    print('словарь которий инициализируеться в функцие exercises = {}'.format(exercises))
    result = exercises.get(exercise_name, None)

    print('Значение возвращяемое функцией : {}'.format(result))
    return result

def get_weight(exercise):
    weights = {
        ST_THRUST: [10, 15, 20]
    }
    return weights.get(exercise)

if __name__ == '__main__':
    input_param = ST_THRUST
    print('Входящий параметр функци input_param = {}'.format(input_param))
    exercise = get_exercise(exercise_name=input_param)
    print('Результат выполнения функции get_exercise = {}'.format(exercise))
    weight = get_weight(exercise = input_param)
    print('{}: {}кг, {}, {}'.format(exercise, weight[0], weight[1], weight[2]))
    sys.exit()

exercise = 'Упражнение'
workout = 'Подход'
repeat = 'Повторений'
n1 = '10-12'
n2 = '8-10'
n3 = '6-8'
n4 = '4-6'
text = (exercise, workout, repeat, n1, n2, n3, n4, pres)
weight = '5, 6, 7, 7.5, 8, 10, 12, 12.5, 14, 16, 17.5, 18, 20, 22, 22.5, 24, 25, 30, 32.5, 35, 40, 45, 50, 60, 65, 70, 75, 80, 90, 100, 130, 155, 180'

strings1 = 'Вторник - група мышц "Спина"\n{0} №1 - Гиперекстензия\n{0[1]} 1: 15 {0[2]}\n{0[1]} 2: 20 {0[2]}\n{0[1]} 3: 20 {0[2]} с блином (10кг)\n{0[1]} 4: 20 {0[2]} с блином (15кг)\n{0[0]} №2 - Становая тяга\n{0[1]} 1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(50кг)\n{0[1]} 3: {0[4]} {0[2]}(70кг)\n{0[1]} 4: {0[5]} {0[2]}(80-90кг)\n{0[1]} 5: {0[5]} {0[2]}(100кг)\n{0[0]} №3 - Тяга блока к груди\n{0[1]} 1: {0[3]} {0[2]}(40кг)\n{0[1]} 2: {0[3]} {0[2]}(50кг)\n{0[1]} 3: {0[4]} {0[2]}(60кг)\n{0[1]} 4: {0[5]} {0[2]}(65кг)\n{0[1]} 5: {0[5]} {0[2]}(70кг)\n{0[0]} №4 - Тяга блока горизонтально\n{0[1]} 1: {0[3]} {0[2]}(30кг)\n{0[1]} 2: {0[3]} {0[2]}(40кг)\n{0[1]} 3: {0[4]} {0[2]}(50кг)\n{0[1]} 4: {0[5]} {0[2]}(60кг)\n{0[1]} 5: {0[5]} {0[2]}(65кг)\n{0[7]}'.format(text)
strings2 = 'Четверг - група мышц "Ноги"\n{0[0]} №1 - Присяд\n{0[1]} 1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(50кг)\n{0[1]} 3: {0[4]} {0[2]}(70кг)\n{0[1]} 4: {0[5]} {0[2]}(80-90кг)\n{0[1]} 5: {0[5]} {0[2]}(100кг)\n{0[0]} №2 - Жым ногами\n{0[1]} 1: {0[3]} {0[2]}(пустой блок)\n{0[1]} 2: {0[3]} {0[2]}(80кг)\n{0[1]} 3: {0[4]} {0[2]}(130кг)\n{0[1]} 4: {0[5]} {0[2]}(155кг)\n{0[1]} 5: {0[5]} {0[2]}(180кг)\n{0[0]} №3 - Разгибание ног\n{0[1]} 1: {0[3]} {0[2]}(50кг)\n{0[1]} 2: {0[3]} {0[2]}(60кг)\n{0[1]} 3: {0[4]} {0[2]}(65кг)\n{0[1]} 4: {0[5]} {0[2]}(70кг)\n{0[1]} 5: {0[5]} {0[2]}(75кг)\n{0[0]} №4 - Сгибание ног\n{0[1]} 1: {0[3]} {0[2]}(30кг)\n{0[1]} 2: {0[3]} {0[2]}(35кг)\n{0[1]} 3: {0[4]} {0[2]}(40кг)\n{0[1]} 4: {0[5]} {0[2]}(45кг)\n{0[1]} 5: {0[5]} {0[2]}(50кг)\n{0[0]} №5 - Икры\n{0[1]} 1: {0[3]} {0[2]}(пустой блок)\n{0[1]} 2: {0[3]} {0[2]}(15кг)\n{0[1]} 3: {0[4]} {0[2]}(30кг)\n{0[1]} 4: {0[5]} {0[2]}(40кг)\n{0[1]} 5: {0[5]} {0[2]}(50кг)\n{0[7]}'.format(text)
strings3 = 'Пятница - група мышц "Трицепс/Бицепс"\nТрицепс\n{0[0]} №1 - Розгиб грифа Z\n{0[1]} 1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(17,5кг)\n{0[1]} 3: {0[4]} {0[2]}(27,5кг)\n{0[1]} 4: {0[5]} {0[2]}(32,5кг)\n{0[1]} 5: 4-8 {0[2]}(37,5кг)\n{0[0]} №2 - Тяга блока в кроссовере\n{0[1]} 1: {0[3]} {0[2]}(20кг)\n{0[1]} 2: {0[3]} {0[2]}(25кг)\n{0[1]} 3: {0[4]} {0[2]}(30кг)\n{0[1]} 4: {0[5]} {0[2]}(40кг)\n{0[1]} 5: {0[5]} {0[2]}(45кг)\n{0[0]} №3 - Разгибание гантели из-за головы\n{0[1]} 1: {0[3]} {0[2]}(14кг)\n{0[1]} 2: {0[3]} {0[2]}(16кг)\n{0[1]} 3: {0[4]} {0[2]}(18кг)\n{0[1]} 4: {0[5]} {0[2]}(20кг)\n{0[1]} 5: {0[5]} {0[2]}(22кг)\nБицепс\n{0[0]} №1 - Тяга штанги на бицепс\n{0[1]} 1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(30кг)\n{0[1]} 3: {0[4]} {0[2]}(35кг)\n{0[1]} 4: {0[5]} {0[2]}(35кг)\n{0[1]} 5: {0[5]} {0[2]}(37,5кг)\n{0[0]} №2 - Тяга на бицепс сидя грифом Z\n{0[1]} 1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(12,5кг)\n{0[1]} 3: {0[4]} {0[2]}(17,5кг)\n{0[1]} 4: {0[5]} {0[2]}(17,5кг)\n{0[1]} 5: {0[5]} {0[2]}(22,5кг)\n{0[0]} №3 - Пампинг бицепса\nТри подхода, по 20-30 {0[2]}(Гантели 5-7кг)\n{0[7]}'.format(text)
strings4 = 'Воскресение - група мышц "Грудь/дельты"\nГрудь\n{0[0]} №1 - Жим лёжа\n{0[1]}1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(50кг)\n{0[1]} 3: {0[4]} {0[2]}(70кг)\n{0[1]} 4: {0[5]} {0[2]}(75кг)\n{0[1]} 5: 4-8 {0[2]}(80кг)\n{0[0]} №2 - Жим гантелями лёжа\n{0[1]} 1: {0[3]} {0[2]}(16кг)\n{0[1]} 2: {0[3]} {0[2]}(18кг)\n{0[1]} 3: {0[4]} {0[2]}(20кг)\n{0[1]} 4: {0[5]} {0[2]}(22кг)\n{0[1]} 5: {0[5]} {0[2]}(24кг)\n{0[0]} №3 - Розводки гантелей лёжа\n{0[1]} 1: {0[3]} {0[2]}(8кг)\n{0[1]} 2: {0[3]} {0[2]}(10кг)\n{0[1]} 3: {0[4]} {0[2]}(12кг)\n{0[1]} 4: {0[5]} {0[2]}(14кг)\n{0[1]} 5: {0[5]} {0[2]}(14кг)\nДельты\n{0[0]} №1 - Жим гантелей сидя\n{0[1]} 1: {0[3]} {0[2]}(12кг)\n{0[1]} 2: {0[3]} {0[2]}(14кг)\n{0[1]} 3: {0[4]} {0[2]}(16кг)\n{0[1]} 4: {0[5]} {0[2]}(18кг)\n{0[1]} 5: {0[5]} {0[2]}(18кг)\n{0[0]} №2 - Жим на дельты в Смите\n{0[1]} 1: {0[3]} {0[2]}(пустой гриф)\n{0[1]} 2: {0[3]} {0[2]}(35кг)\n{0[1]} 3: {0[4]} {0[2]}(35кг)\n{0[1]} 4: {0[5]} {0[2]}(40кг)\n{0[1]} 5: {0[5]} {0[2]}(45кг)\n{0[0]} №3 - Розводки гантелей стоя\n{0[1]} 1: {0[3]} {0[2]}(6кг)\n{0[1]} 2: {0[3]} {0[2]}(8кг)\n{0[1]} 3: {0[3]} {0[2]}(10кг)\n{0[1]} 4: {0[5]} {0[2]}(10кг)\n{0[1]} 5: {0[5]} {0[2]}(12кг)\n{0[7]}'.format(text)
print("Выбирите день тренировок:\n1 - Tuesday\n2 - Thursday\n3 - Friday\n4 - Wednesday")
day = int(input("Введите число, от 1 до 4: "))
def echo():
    if day == 0 or day<0 or day>4:
        print("Вы выбрали 0, или число которое меньше либо больше заявленого")
    elif day == 1:
        print(strings1)
    elif day == 2:
        print(strings2)
    elif day == 3:
        print(strings3)
    elif day == 4:
        print(strings4)
echo()